tap "ariga/tap"
tap "chainguard-dev/tap"
tap "defenseunicorns/tap"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "pkgxdev/made"
tap "universal-ctags/universal-ctags"
brew "ack"
brew "act"
brew "atuin"
brew "crane"
brew "direnv"
brew "docker"
brew "envchain"
brew "exercism"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "gotags"
brew "gotestsum"
brew "python@3.13"
brew "graphviz"
brew "grype"
brew "helm"
brew "hub"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lua"
brew "luarocks"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "opentofu"
brew "oras"
brew "pkgconf"
brew "pnpm"
brew "pre-commit"
brew "prettierd"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id", link: true
brew "sshuttle"
brew "terraform"
brew "terraform-ls"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "trivy"
brew "typescript-language-server"
brew "universal-ctags"
brew "uv"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "yt-dlp"
brew "chainguard-dev/tap/chainctl"
brew "defenseunicorns/tap/uds"
brew "jesseduffield/lazygit/lazygit"
brew "pkgxdev/made/pkgm"
cask "gpg-suite"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
